<template>
  <el-image :src="imgUrl" :preview-src-list="srcList" />

  <div class="item">
    <p class="title">说明</p>
    <p>1、录取是按批次（提前批、本科、专科）进行，因此本篇所介绍的流程为一个批次的录取流程，对所有批次均适用。</p>
    <p>2、所有批次均是走一遍此流程来鉴别考生是否录取以及录取在哪个大学哪个专业。</p>
    <p>
      3、注意：在录取流程上统招与征集是区分的，例如：本科批次的统招与征集，可视为是俩个批次，是分别执行各自的流程，而非作为一个整体只执行一遍流程。
    </p>
    <p>4、每一个院校代码都会对应划出一个投档线，每一个专业代码都会对应划出一个专业线。</p>
    <p>5、关于批次、统招、征集、投档线、专业线、退档等名称的详细解释，可前往“资料>辅导资料>辅导填报与名词解释”中搜索查看</p>
  </div>

  <div class="item">
    <p class="title">录取流程</p>
    <p>1、某个批次录取开始，准备对某考生进行录取，先获取该考生的高考分数与该考生在该批次填写的志愿。</p>
    <p>2、志愿按照考生填写的顺序，从上往下依次对比考生高考分数是否超过该志愿的投档线。</p>
    <p>3、如果分数未超过志愿的投档线，则对比下一个志愿，直至该批次的所有志愿对比结束。</p>
    <p>3.1、该批次的所有志愿对比结束，考生的高考分数都没有超过任何一个所填志愿的投档线，则该考生滑档，本批次全部录取流程结束，即该考生未被其所填写在该批次的任何志愿录取。</p>
    <p>
      <span>3.2、考生滑档，滑去下一批次。注意滑去的下一批次是区分了统招与征集。</span>
      <span>例如：考生在本科统招滑档，则滑至本科第一次征集；若本科第一次征集滑档，则滑去本科第二次征集（若本科征集不举行第二次，是滑去专科提前批）。</span>
      <span class="delete">专科征集再滑档就没书读了。</span>
    </p>
    <p>
      <span>4、如果分数超过志愿的投档线，则考生的档案投递至该志愿（可认为考生初步被该院校录取），进行后续流程（专业录取）。</span>
      <span>同时该批次填写在该志愿后面的所有志愿全部作废不再对比（平行志愿一次投档原则）。</span>
    </p>
    <p>4.1、如果分数同时超过了多个志愿的投档线，因为对比是按填写顺序从上往下，因此是投档至填写靠前的志愿。</p>
    <p>4.2、因为平行志愿的一次投档原则，一旦分数超过某个志愿的投档线，则该批次填写在该志愿后面的所有志愿全部作废。</p>
    <p>5、当考生过了某志愿的投档线投档至该志愿后，接下来录取专业，获取该考生在该志愿填写的专业。</p>
    <p>6、专业的录取流程大致与志愿的录取流程类似。专业按照考生填写的顺序，从上往下依次对比考生高考分数是否超过该专业的专业线。</p>
    <p>7、如果分数未超过专业的专业线，则对比下一个专业，直至投档志愿的所有专业对比结束。</p>
    <p>7.1、所有专业对比结束，考生高考分数都没有超过任何一个所填专业的专业线，则查询该考生是否服从所投档志愿的调剂。</p>
    <p>7.2、如果考生服从调剂，则考生最终录取在该院校，专业则由院校指定，本批次全部录取流程结束。</p>
    <p>7.3、如果考生不服从调剂，则考生被退档，本批次全部录取流程结束。</p>
    <p>7.4、考生被退档，后果与滑档一致，退至下一批次。</p>
    <p>8、如果分数超过专业的专业线，则考生成功录取至该志愿的该专业，本批次全部录取流程结束。</p>
    <p>8.1、与志愿录取同理，如果分数同时超过多个专业的专业线，因为对比是按填写顺序从上往下，因此是录取至填写靠前的专业。</p>
  </div>

  <div class="item">
    <p class="title">总结</p>
    <p>1、一句话概括退档：按照考生填写的志愿顺序，考生会投档至第一个高考分数超过投档线的志愿，但考生高考分数又都未超过该志愿下所填的全部专业的专业线，又不服从调剂，则会被退档。</p>
    <p>2、退档的后果很严重，注意退档是退去下一批次，而不是退去下一志愿。因此建议全部志愿都服从调剂。</p>
    <p>3、平行志愿一次投档原则，一个批次只会投档一次，一旦投档，则投档志愿后面所填的志愿全部作废，这也是退档是退去下一批次的原因，因为本批次不再投档。</p>
  </div>
</template>

<script>
export default {
  name: 'admissionFlow',
  data() {
    return {
      imgUrl: new URL('@/../public/image/flow.jpg', import.meta.url).href,
      srcList: [new URL('@/../public/image/flow.jpg', import.meta.url).href],
    }
  }
}
</script>

<style scoped lang="scss">
.item {
  margin-bottom: 24px;

  p {
    margin: 0;
  }
}

.title {
  font-size: 20px;
  font-weight: bold;
}

.important-description {
  color: red;
  text-decoration: underline;
}

.delete {
  text-decoration: line-through;
}
</style>